CATEGORIES = [
    (1000000003, "макияж"),
    (1000000004, "уход"),
    (1000000007, "парфюмерия"),
    (1000000006, "волосы"),
    (1000000010, "азиатская косметика"),
    (1000003870, "техника"),
    (1000008202, "товары для дома"),
    (1000005746, "украшения"),
    (1000008529, "одежда и аксессуары"),
    (1000003747, "аптека"),
    (1000000012, "натуральная косметика"),
    (1000142470, "уборка и гигиена"),
    (1000005962, "сексуальное здоровье"),
    (1000004357, "для детей"),
    (1000003887, "для мужчин"),
    (1000134334, "фигура мечты"),
    (1000005159, "тревел"),
    (1000138486, "видеоконсультация"),
]

PROXIES = [
    "http://212.60.20.208:8080",
    "http://117.1.240.160:10018",
    "http://178.177.54.157:8080",
    "http://178.34.190.6:8080",
    "http://67.43.228.250:12439",
    "http://67.43.228.250:32523",
    "http://188.133.203.220:8081",
    "http://67.43.228.250:32523",
    "http://93.177.126.79:8088",
    "http://176.226.214.224:8081",
    None,
]
HEADERS = {
    "User-Agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.0.0 Safari/537.36",
    "Accept": "application/json, text/plain, */*",
    "Accept-Encoding": "gzip, deflate, br",
    "Accept-Language": "ru-RU,ru;q=0.9,en-US;q=0.8,en;q=0.7",
    "Referer": "https://goldapple.ru/",
    "X-App-Version": "1.62.0",
    "X-FP": "2fa80771a022b9c7fb492e899b30b09d",
}

BASE_URL = "https://goldapple.ru/front/api/catalog/products"
